app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "viethoang"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "viethoang"], ["LIMIT", 1]]
---
  def create
    email_username = params[:session][:email_username]
    user = if email? email_username
             User.find_by email: email_username
           else
             User.find_by username: email_username