app/controllers/users_controller.rb

  def create
    @user = User.new user_params
    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "username", "name") VALUES (?, ?, ?, ?, ?, ?)

  def get_user
    @user = User.find_by id: params[:id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]